[
  {
    "title": "“Railway as a Thing” : New Railway Control System in Egypt using IoT",
    "authors": "Mostafa A- A. Mostafa Osama Orans",
    "venue": "nan",
    "year": null
  },
  {
    "title": "“Color Block Image Encryption Scheme based on Confusion – Diffusion Architecture.",
    "authors": "Alaa Zaghloul Nehal A. Mohamed and Mostafa A. El-Azeim",
    "venue": "International Journal of Information Assurance and Security (JIAS), ISSN 1554-1010, Volume 10, 2016.",
    "year": null
  },
  {
    "title": "visual target for tracking algorithm",
    "authors": "Abas frag S. El Gonamy and M.Mostafa Abdel Aziem",
    "venue": "nan",
    "year": null
  },
  {
    "title": "performance evaluation of neognitron neural network model for recognition of aircraft patterns",
    "authors": "Mostafa A. Abdel Aziem Mostafa",
    "venue": "AASTMT",
    "year": null
  },
  {
    "title": "multi intelligent agent system for maximizing the date warehouse investiment",
    "authors": "Raed Hosny Mostafa Abdel Aziem and M. Abo Rizka",
    "venue": "nan",
    "year": null
  },
  {
    "title": "feature selection in document clustring using Rough sets,",
    "authors": "Hoda Saleh M. Mostafa",
    "venue": "nan",
    "year": null
  },
  {
    "title": "enhancing arabic question answering system using latent semantic indexing",
    "authors": "m. Mahamoud Amal Ibrahim and Mostafa A. Mostafa",
    "venue": "Intenational Jurnal of Computer Applications",
    "year": null
  },
  {
    "title": "automatic detection of features using hyprid neural networks, M. Siam, M.Abdel Aziem, M.El Menshawy",
    "authors": "M.El Menshawy and M. Siam and M.Abdel Aziem",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Video Copy Detection Based On Hidden Markov Models and Invariant Moments",
    "authors": "Marwa Mohamed Dawoud and Mohamed El Mahallawy and Mohamed Waleed Fakhr and Mostafa Abdel Azeem",
    "venue": "international journal of Engineering research and application",
    "year": null
  },
  {
    "title": "VeSimulator :A Location-Based Vehicle Simulator Model for IoT Applications",
    "authors": "Mostafa A- A Mostafa Osama Oranse",
    "venue": "The 7th  International conference for Information Technology( ICIT 15)",
    "year": null
  },
  {
    "title": "Tweets Classification, Hashtags Suggestion and Tweets Linking in Social Semantic Web",
    "authors": "Mostafa A. A. Mostafa Ali Rehab Gahaly",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Rough sets analysis for feature selection and reduction,",
    "authors": "Hoda Saleh M. Mostafa",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Recognation of air craft patterns by a new rotation invarient Neocognitron",
    "authors": "M. Mostafa Abdel Aziem Mostafa",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Quantitative and qualitative evaluations of image enhancement techniques",
    "authors": "Moustafa Abdel Aziem Moustaf and Hanafy M Ismaiel",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Quantified extreme scenario based design approach",
    "authors": "Asmaa Abdallah and Riham Hassan and Mostafa Abdel Azim",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Prediction of Antigenic Epitope Patches on Protein Surface Using Antigen Structure Information and Support Vector Machine",
    "authors": "Khaled A Hassan and Amr Badr and Mostafa Abdel-Azim",
    "venue": "American Journal of Bioinformatics Research",
    "year": null
  },
  {
    "title": "Predicting MHC Class II Epitopes Using Separated Constructive Clustering Ensemble",
    "authors": "Hossam Fathy ElSemellawy and Amr Badr and Mostafa Abdel Aziem",
    "venue": "American Journal of Bioinformatics Research",
    "year": null
  },
  {
    "title": "Performance evalution of software project effort estimation by analogy, neural networks, and COCOMO models",
    "authors": "Gouda M. Abdel Aziem Mostafa and S. Ezut and I. Hanafy",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Performance evaluation of quality measurement for super-resolution satellite images",
    "authors": "Hatem Magdy Keshk and M Moustafa Abdel-Aziem and Ashraf S Ali and MA Assal",
    "venue": "nan",
    "year": null
  },
  {
    "title": "PCA Neural Network For Extracting Features From Femur Fracture in X-Ray Images",
    "authors": "Mostafa M Syiam and Mostafa Abd El-Aziem and Mohamed El Menshawy",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Online English to Arabic Translation Enhancement by domain data adaptation",
    "authors": "Mostafa Abdel Aziem Mohsen Rashwan and Mohamed Waleed Fakhr",
    "venue": "nan",
    "year": null
  },
  {
    "title": "On Predicting Conformational B-cell Epitopes: a Comparative Study and a New Model",
    "authors": "Khaled A Hassan and Amr Badr and M. Abdel Aziem",
    "venue": "American Journal of Bioinformatics Research",
    "year": null
  },
  {
    "title": "New binary particle swarm optimization with immunity-clonal algorithm",
    "authors": "EL-Gammal Dina and Amr Badr and Mostafa Abd El Azeim",
    "venue": "Journal of Computer Science",
    "year": null
  },
  {
    "title": "New Mobile Digital Signature Solution Based on Micro SD",
    "authors": "Bahaa Hassan. Khaled Moawad and Mostafa Abdel-Aazim",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Multi Agents system for  Management of Auctions and  Trading Systems",
    "authors": "Mostafa Abdel  Aziem M. and Abdul  Mageed EL  Sadek and Ahmed E.  Hamed",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Motion prediction based on adaptive Karman filtering within object track",
    "authors": "Abass Farg M. Sharawy and M.Mostafa Abdel Aziem",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Modified SET protocol for mobile payment: an empirical analysis",
    "authors": "Sabrina M Shedid and M. Mostafa Kouta and Mohamed",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Modified SET protocol for mobile payment",
    "authors": "M. Abdel Aziem Sabrina. M. Sheded",
    "venue": "nan",
    "year": null
  },
  {
    "title": "LARGE SCALE LINEAR CODING FOR IMAGE CLASSIFICATION",
    "authors": "Mustafa Ibrahim and Mohamed Waleed Fakhr and Mustafa Abdel Aziem",
    "venue": "Ubiquitous Computing and Communication Journal",
    "year": null
  },
  {
    "title": "LARGE SCALE LINEAR CODING FOR IMAGE CLASSIFICATION",
    "authors": "Dr. Mustafa Abdel Aziem Ali Mr. Mostafa Ibrahim Labib and Dr. Mohamed Waleed",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Integrated a CAD system and a computer vision system",
    "authors": "Mostafa A-Aziem Mostafa",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Information technology service management(ITSM) Implementation methodology based on Information technology infrastructure library (ITIL V3),",
    "authors": "Essam Elfakharany Mostafa M. AlShamy and Mostafa Abdel Aziem",
    "venue": "International journal of business research and Management (IJBRM),",
    "year": null
  },
  {
    "title": "Improving Image Encryption using 3D Cat mMap and Turing Machine.",
    "authors": "Mostafa A. El-Azeim. Nehal A. Mohamed and Alaa Zaghloul",
    "venue": "International Journal of Advanced Computer Science and Applications (IJACSA), ISSN 2156 5570, 2016.",
    "year": null
  },
  {
    "title": "Image Encryption Scheme for Secure Digital Images based on 3D Cat Map and Turing Machine.",
    "authors": "Ahmed A. Abd ElLatif. “ Nehal A. Mohamed and Alaa Zaghloul and Mostafa A. El-Azeim",
    "venue": "nan",
    "year": null
  },
  {
    "title": "IT Service Managament Implementation Based on ITIL V3",
    "authors": "Essam Elfahkarany Mostafa M. Elshamy and Mostafa Abdel Aziem",
    "venue": "Al Azhar University, Engineering sector, JURS",
    "year": null
  },
  {
    "title": "Highly constrained tasks scheduling on multiprocessing systems",
    "authors": "M. Mostafa Abdel Mageed El Sadek",
    "venue": "Computer Engineering, Ain Shams, Cairo, Egypt.",
    "year": null
  },
  {
    "title": "GIS- based environment model to simulate the dispersion of Air pollutants",
    "authors": "H. Algamely M. Mostafa",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Fly over the clouds or drive through the crowd: a cloud adoption framework in action",
    "authors": "Eman M Ezzat and Doaa S Elzanfaly and Mostafa A Mostafa",
    "venue": "International Journal of Computer Applications",
    "year": null
  },
  {
    "title": "Fly Over the Clouds of Drive Through the Crowd-Quality measurments prespective,",
    "authors": "Doaa El Zanfaly Eman Mousheir Ezzat and Mostafa Abd El Aziem",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Fault tolerance of tasks scheduling on multiprocessing systems.",
    "authors": "Abdel Mageed El Sadek M. Mostafa",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Estimatibg software project effort br regression and neural network models,",
    "authors": "Gouda M. Abdel Aziem Mostafa and S. Ezut and I. Hanafy",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Enhanced Parallel NegaMax Tree Search Algorithm on GPU",
    "authors": "Ahmed A Elnaggar and Mahmoud Gadallah and Mostafa Abdel Aziem and Hesham El-Deeb",
    "venue": "IEEE conference",
    "year": null
  },
  {
    "title": "Doman specific search engin with suggestions generated using association rules and term frequency: case study in the medical Domain",
    "authors": "M. Kouta Al Shaimaa A. Arafa and Mostafa A Aziem",
    "venue": "Al Azhar University, Engineering sector, JURS",
    "year": null
  },
  {
    "title": "Designing and Building a Framework for DNA Sequence Alignment Using Grid Computing",
    "authors": "M. Assel Saied Oraby and Mustafa Abdel Aziem Mostafa and Yasser Omar",
    "venue": "(IJACSA) International Journal of Advanced Computer Science and Applications,",
    "year": null
  },
  {
    "title": "DRTX: A Duplicate Resolution Tool for XML Repositories",
    "authors": "Randa Mohamed Abd El-ghfar and EL-Bastawissy Ali and Mostafa Abdel Azeim Mostafa",
    "venue": "IJCSNS",
    "year": null
  },
  {
    "title": "DNA fingerprint using smith waterman algorithm by grid computing",
    "authors": "El-Sayed Orabi and Mohamed A Assal and Mustafa Abdel Azim and Yasser Kamal",
    "venue": "nan",
    "year": null
  },
  {
    "title": "DNA Fingerprint using smith waterman Algorithm by grid computing",
    "authors": "Yasser Mostafa Saied Oraby and M. Assal and M. Mostafa Abdel Aziem",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Cross-Language Name Matching for Data Fusion in Linked Open Data",
    "authors": "Enad Al Abd Ziad Turky and M Abdel Aziem Mostafa",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Computer Aided Diagnosis for micro calcification cluster",
    "authors": "A. Badr M. Mostafa",
    "venue": "Egyptian computer Science Journal",
    "year": null
  },
  {
    "title": "Autonomous checkers robot using enhanced massive parallel game tree search",
    "authors": "Ahmed A Elnaggar and Mahmoud Gadallah and Mostafa Abdel Aziem and Hisham Aldeeb",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Autonomous chechers robot using enhanced massive parallel game tree search",
    "authors": "M.Gadalla Ahmed A. Elnaggar and Mostafa. A. A. M. and Hesham",
    "venue": "The sientific World journal",
    "year": null
  },
  {
    "title": "Automatic recognation of engineeringdrawing for office automation system",
    "authors": "A. Fahmy M. Amin and Mostafa A-Aziem",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Automated FISH Signals Fusion Detection for Chronic Myeloid Leukemia Diagnosis",
    "authors": "Ashraf Abdel Raouf shrouk Moataz and Mostafa Abdel Aziem and m. ali",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Augmented reality, maintenance training framwork with intel depth camera",
    "authors": "Hussin Ali Mohamed Abdel Naby and Mostafa A.A mostafa Ali",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Applications of mixed chaotic systems for data base security",
    "authors": "Alaa Rohiam Eman Wafae and M. Abdel Aziem Mostafa",
    "venue": "European Journal of Scientific Research",
    "year": null
  },
  {
    "title": "Application-specific dynamic policy rules (ASDPR) for J2ME",
    "authors": "Ahmed AlSum and Ayman Abdel-Hamid and Mostafa Abdel-Aziem",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Analysisy of Game Tree Searching Methods",
    "authors": "H. El Deab Ahmed El Naggar and M. Mostafa Abdel Aziem and M",
    "venue": "International Journal of Computer Applications (0975 – 8887)",
    "year": null
  },
  {
    "title": "An interactive multi-media system for teaching an object oriented programming languages",
    "authors": "Mostafa A-Aziem Mostafa",
    "venue": "nan",
    "year": null
  },
  {
    "title": "An intelligent teaching system by showing using heuristics",
    "authors": "M. Mostafa Abdel Aziem",
    "venue": "nan",
    "year": null
  },
  {
    "title": "An integration of speech and vision technologies",
    "authors": "M. EL S. Gadalla Mostaf. A-Aziem Mostafa",
    "venue": "nan",
    "year": null
  },
  {
    "title": "An effecient algorithm for clustering of documents,",
    "authors": "Hoda saleh M. Mostafa",
    "venue": "nan",
    "year": null
  },
  {
    "title": "An Efficient Signature System Using Optimized RSA Algorithm",
    "authors": "Rania Salah El-Sayed and Moustafa Abd El-Aziem and Mohammad Ali Gomaa",
    "venue": "IJCSNS",
    "year": null
  },
  {
    "title": "An Efficient Indoor Localization System Based on Affinity Propagation and Support Vector Regression",
    "authors": "Mustafa Abdel Aziem and Ashraf Ashraf Abdou",
    "venue": "nan",
    "year": null
  },
  {
    "title": "An Educational Data Mining Model for Early Prediction for Risky Students using Decision Tree”",
    "authors": "Mai Akeef and M. abdel Aziem Mostafa and M. El Zwedy and A. Al Abasy",
    "venue": "European Journal of Scientific Research ,  October, 2014,",
    "year": null
  },
  {
    "title": "An Educational Data Mining Model for Early Prediction for Risky Students using Decision Tree",
    "authors": "M. Al Zweady Mai Akeef and Mostafa A-A Mostafa and A. Al Abasy",
    "venue": "European Journal of Scientific Research",
    "year": null
  },
  {
    "title": "Advancing Artificial Intelligence Disciplines by Inspiring from Immune System",
    "authors": "Amr Badr Mohamed Abdo and Mostafa A.A. Mostafa",
    "venue": "International Conference on Intelligent Systems and Applications 2014",
    "year": null
  },
  {
    "title": "Advanced technique for improving the performance of the slotted presistent CSMA/CD protocol",
    "authors": "I. El Omary M. Mostafa Abdel Aziem Mostafa",
    "venue": "nan",
    "year": null
  },
  {
    "title": "AdAgen: Adaptive interface agent for X-ray fracture detection",
    "authors": "Mostafa Syiam and Mostafa Abd El-Aziem and Mohamed El-Menshawy",
    "venue": "International Journal of Computing & Information Sciences",
    "year": null
  },
  {
    "title": "AdAgen: Adaptive interface agent for X-ray fracture detection",
    "authors": "M. Elmenshawy M. Mostafa",
    "venue": "Journal of computing and information science, Canada",
    "year": null
  },
  {
    "title": "AdAgen: Adaptive interface agent for X-ray fracture detection",
    "authors": "M. El Menshawy M. Siam and M. Abdel Aziem",
    "venue": "nan",
    "year": null
  },
  {
    "title": "Accurate individualized therapeutic plans ontology based evidence based midicine",
    "authors": "K. Al bahnacy Asmaa A. Al kholy and Mostafa Abdel Aziem Mostafa",
    "venue": "nan",
    "year": null
  },
  {
    "title": "A topology mapping for mesh interconnected multi-processor systems",
    "authors": "M. Shokr Mostafa A-Aziem",
    "venue": "nan",
    "year": null
  },
  {
    "title": "A performance evaluation of signature analysis based algorithm for fault detection in digital circuits",
    "authors": "M. Shokr M. El M.B. Galal and Mostafa A-Aziem",
    "venue": "nan",
    "year": null
  },
  {
    "title": "A novel model for capturing and analyzing customers' preferences for ceramic tiles",
    "authors": "Hossam El-Sobky and Mostafa AbdelAzeim",
    "venue": "nan",
    "year": null
  },
  {
    "title": "A new framework of software testing using cloud computing for banking applications",
    "authors": "Ashraf Abdel Raoaf Aya Al Nagdy and Mostafa A.A. Mostafa Ali",
    "venue": "nan",
    "year": null
  },
  {
    "title": "A generic Algorithm for converting flow charts into program code: CASE tool for teaching structure programming Language,",
    "authors": "shreif fadel M. Mostafa A- Aziem",
    "venue": "nan",
    "year": null
  },
  {
    "title": "A fractal geometry based fourier transform for computer vision systems",
    "authors": "M. EL M.B. Galal Mostafa A-Aziem Mostafa",
    "venue": "nan",
    "year": null
  },
  {
    "title": "A fractal based approach for image compression and decompression",
    "authors": "Mostafa A-Aziem Mostafa",
    "venue": "nan",
    "year": null
  },
  {
    "title": "A fast algorithm for computer vision systems.",
    "authors": "M. EL. M.B. Galal Mostafa A-Aziem",
    "venue": "nan",
    "year": null
  },
  {
    "title": "A better way to compress images using transform coding for computer vision",
    "authors": "M. Shokr Mostafa A-Aziem",
    "venue": "nan",
    "year": null
  },
  {
    "title": "A Survey of Game Tree Searching Methods",
    "authors": "Ahmed A Elnaggar and Mahmoud Gadallah and Mostafa Abdel Aziem and Hesham El-Deeb",
    "venue": "nan",
    "year": null
  },
  {
    "title": "A Novel image fusion Algorithm for multi- focus single-sensor image fusion based on image complexity measurements",
    "authors": "Mostafa Abdel Aziem Dina El Gammal and Goda Ismail",
    "venue": "Egyptian Computer Science Journal",
    "year": null
  },
  {
    "title": "A New approach for Distributed Software engineering teams based on Kanaban Method for reducing dependancy",
    "authors": "Ahmad Bahaa Maha and Yagoub and Mostafa and A.A. M. Ali",
    "venue": "Journal of Software Engineering 2016 Volume 11 Number 12 (Dec. 2016)",
    "year": null
  },
  {
    "title": "A New Remote Authentication Model for Online Examination Systems\"",
    "authors": "Moustafa Abd El Aziem and Essam El Dien El Fakharany Ghada Ashraf El Sayad",
    "venue": "European Journal of Scientific Research, Vol. 125 No 1 September, 2014.",
    "year": null
  },
  {
    "title": "A Comparative Study of Game Tree Searching Methods",
    "authors": "Ahmed A Elnaggar and Mahmoud Gadallah and Mostafa Abdel Aziem and Hesham El-Deeb",
    "venue": "nan",
    "year": null
  },
  {
    "title": "A Comparative Study of Game Tree Searching Methods",
    "authors": "Hesham El-Deeb and Mahmoud Gadallah and Mostafa Abdel Aziem and Ahmed A Elnaggar",
    "venue": "nan",
    "year": null
  },
  {
    "title": "A Cognitive Computational Model Inspired by the Immune System Response",
    "authors": "Mohamed Abdo and Amr Badr and Mostafa Abd Al-Azim",
    "venue": "Biotechnology",
    "year": null
  },
  {
    "title": "A Cognitive Computational Model Inspired by the Immune System Response",
    "authors": "and Mostafa Abd Al-Azim Mohamed Abdo and Amr Badr Badr",
    "venue": "BioMed Research International",
    "year": null
  },
  {
    "title": "A COMPARATIVE STUDY FOR RHODOPSIN PROTEIN FOLDING PROBLEM",
    "authors": "Mostafa Abdel Azim Iman Ahmed Mahmoud and Amr Ahmed Badr",
    "venue": "Journal of Computer Science, 2014,",
    "year": null
  }
]